A1 = [2, 1, -1, -1, 1; 
     1, -1, 1, 1, -2; 
     4, -1, 1, 1, -3; 
     3, 3, -3, -3, 4];
B1 = [0; 0; 0; 0];

AB1 = [A1, B1];

fprintf('Перша матриця системи:\n');
disp(AB1);

rref_AB1 = rref(AB1);

fprintf('Розв''язок для першої системи рівнянь:\n');
disp(rref_AB1);

fprintf('-----------------------------------\n');

A2 = [2, 2, -2, 1, 1;
     2, -3, 1, -2, 2;
     1, 1, -1, -3, 1;
     3, 1, -3, -1, 1];
B2 = [4; 0; -1; 1];

AB2 = [A2, B2];

fprintf('Друга матриця системи:\n');
disp(AB2);

rref_AB2 = rref(AB2);

fprintf('Розв''язок для другої системи рівнянь:\n');
disp(rref_AB2);