eq1 = 'x + y + 2z = -9';
eq2 = '-3x - 2y - 4z = 20';
eq3 = '-3x - 3y - 5z = 24';
fprintf('Рівняння системи:\n%s\n%s\n%s\n\n', eq1, eq2, eq3);

A = [1, 1, 2; -3, -2, -4; -3, -3, -5];
fprintf('Матриця коефіцієнтів (ліва частина системи):\n');
disp(A);

B = [-9; 20; 24];
fprintf('\nМатриця правої частини системи:\n');
disp(B);

det_A = det(A);
fprintf('\nВизначник головної матриці: det(A) = %.4f\n', det_A);

if det_A ~= 0
    x = zeros(3, 1);

    %метод Крамера
    for i = 1:3
        % Заміна i-го стовпця головної матриці на стовпець правої частини
        A_temp = A;
        A_temp(:, i) = B;

        % Знаходження визначника матриці A_temp
        det_A_temp = det(A_temp);

        % Розв'язання для x, y та z
        x(i) = det_A_temp / det_A;
        fprintf('x%d = %.4f\n', i, x(i));
    end
else
    disp('Система рівнянь не може бути вирішена методом Крамера (визначник дорівнює 0)');
end