eq1 = '5x - 4y = -9';
eq2 = '-2x - 3y = -24';
fprintf('Рівняння системи:\n%s\n%s\n\n', eq1, eq2);

A = [5, -4; -2, -3];
fprintf('Матриця коефіцієнтів (ліва частина системи):\n');
disp(A);

B = [-9; -24];
fprintf('\nМатриця правої частини системи:\n');
disp(B);

det_A = det(A);
fprintf('\nВизначник головної матриці: det(A) = %.4f\n', det_A);

% Перевірка на можливість розв'язання 
if det_A ~= 0
    x = zeros(2, 1);

    %метод Крамера
    for i = 1:2
        % Заміна i-го стовпця головної матриці на стовпець правої частини
        A_temp = A;
        A_temp(:, i) = B;

        % Знаходження визначника матриці A_temp
        det_A_temp = det(A_temp);

        % Розв'язання для x та y
        x(i) = det_A_temp / det_A;
        fprintf('x%d = %.4f\n', i, x(i));
    end
else
    disp('Система рівнянь не може бути вирішена методом Крамера (визначник дорівнює 0)');
end