%(6x - 5y = - 31, -6x - 5y = - 41)
A1 = [6, -5; -6, -5];
fprintf('Матриця коефіцієнтів для першої системи:\n');
disp(A1);

B1 = [-31; -41];
fprintf('\nМатриця правої частини для першої системи:\n');
disp(B1);

solution1 = A1 \ B1;

fprintf('\nРозв''язок для першої системи рівнянь:\n');
fprintf('x = %.4f, y = %.4f\n\n', solution1(1), solution1(2));

%(x + 3y + 3z = -2, 2x + 7y + 8z = -1, 2x + 6y + 7z = -1)
A2 = [1, 3, 3; 2, 7, 8; 2, 6, 7];
fprintf('Матриця коефіцієнтів для другої системи:\n');
disp(A2);

B2 = [-2; -1; -1];
fprintf('\nМатриця правої частини для другої системи:\n');
disp(B2);

solution2 = A2 \ B2;

fprintf('\nРозв''язок для другої системи рівнянь:\n');
fprintf('x = %.4f, y = %.4f, z = %.4f\n\n', solution2(1), solution2(2), solution2(3));